package Udemy.testing;

public class Lesson14_Cycle_FOR {
    public static void main(String[] args) {
        for(int x=1; x<=5; x++ )
        {
            System.out.println("Сегодня было холодно, но солнечно");
        }
//---------------------------------------------------------------------------------
        for(int y=1; y<=10; y=y+2)
        {
            System.out.println("Нечетные числа: "+y);
        }
 //--------------------------------------BREAK------------------------------------------
        for (int z=1; z<=10;z++)   //Проверяем условие, с помощью оператора if
        {
            if(z==6)              //если значение z равно 6, прерываем цикл и выводим на экран значения
            { break; }
            System.out.println("z="+z);
        }
//-------------------------------------CONTINUE-------------------------------------------
        for (int k=1; k<=10;k++)   //Проверяем условие, с помощью оператора if
        {
            if(k==6)              //если значение z равно 6, прерываем цикл и выводим на экран значения
            { continue; }        //Пропускает число 6 и продолжает цикл
            System.out.println(" k="+k);
        }
//-------------------------------------ЦИКЛ ВНУТРИ ЦИКЛА--------------------------------------------------
        for(int hour=0; hour<=23;hour++)
        {
            for(int minute=0;minute<=59;minute++)
            {
                System.out.println("Время "+hour+":"+minute);
            }
        }

    }

}
